Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Все опорные точки маршрута делятся на путевые (wayPoint) и транзитные (viaPoint). Путевые точки - это точки, в которых необходимо сделать остановку, а транзитные - через которые нужно проложить маршрут без остановки.
en: All anchor points on the route are divided into waypoints (wayPoint) and throughpoints (viaPoint). Waypoints are points at which you must stop, and throughpoints are passed through on the route without stopping.

source: После того как все маршруты были построены, самый короткий из них автоматически становится активным. Такой маршрут отображается на карте фиолетовым цветом. Серые пунктирные линии обозначают пересадки с одного вида транспорта на другой или переход между станциями (для маршрута на общественном транспорте). Неактивные маршруты отображаются серым цветом. Для переключения активного маршрута достаточно кликнуть правой кнопкой мыши по нужному маршруту. Также переключить активный маршрут можно программно. См. [#$dp22].
en: After all routes have been built, the shortest of them becomes active automatically. This route is shown on the map in purple. Grey dotted lines represent transfers from one type of transport to another, or transferring between stations (for a route on public transport). Inactive routes are displayed in gray. To switch the active route, right-click on the desired route. The active route can also be switched programmatically. See [#$dp22].

source: Примеры. Построение мультимаршрута
en: Examples. Planning a multiroute

source: @param {Object} model Модель мультимаршрута. Задается объектом с полями: referencePoints - описание опорных точек мультимаршрута (обязательное поле); params - параметры мультимаршрута.
en: @param {Object} model The model of a multiroute. It is defined by an object with fields: referencePoints - a description of the multiroute reference points (mandatory field); params - multiroute parameters.

source: Максимальное количество маршрутов, которое вернет маршрутизатор.
en: The maximum number of routes that the router will return.

source: Массив индексов точек, которые будут трактоваться как транзитные. Обратите внимание, что для задания тразнитных точек в referencePoints должно быть задано не менее трех опорных точек. viaIndexes: [1]
en: An array of point indices, which will be treated as throughpoints. Note that to specify through points, referencePoints must have at least three reference points set. viaIndexes: [1]

source: Автоматически устанавливать границы карты так, чтобы маршрут был виден целиком.
en: Automatically set the boundaries of the map so that the route is entirely visible.

source: [#$dp5] - класс, позволяющий добавить на карту большое количество объектов без необходимости создавать метки по отдельности.
en: [#$dp5] - class that allows you to add a large number of objects without having to create placemarks separately.

source: Объекты, добавленные в ObjectManager, располагаются в коллекции ObjectManager.objects. Кластеры, образованные из добавленных меток, добавляются в коллекцию ObjectManager.clusters.
en: Objects added in ObjectManager, are in the ObjectManager.objects collection. The clusters formed from the added placemarks are added to the ObjectManager.clusters collection.

source: У этих коллекций есть менеджеры управления балунами и хинтами (ObjectManager.objects.balloon, ObjectManager.clusters.hint).
en: These collections have managers that control balloons and hints (ObjectManager.objects.balloon, ObjectManager.clusters.hint).

source: Примеры. Работа с балуном в ObjectManager
en: Examples. Working with the balloon in ObjectManager

source: API предоставляет возможность задавать меткам собственные изображения.
en: The API provides the ability to set custom images for placemarks.

source: iconImageHref: {URL графического файла}.
en: iconImageHref: {URL of the graphic file}.

source: API позволяет определять координаты объекта по его названию и название объекта по его координатам (прямое и обратное геокодирование).
en: The API can determine the coordinates of an object by its name and the name of an object by its coordinates (forward and reverse geocoding).

source: Оба вида геокодирования производятся с помощью функции [#$dp10]. Результат, возвращаемый этой функцией, может быть сразу размещён на карте.
en: Both types of geocoding are performed using the [#$dp10] function. The result returned by this function may be placed on the map immediately.

source: В данном примере используется обратное геокодирование: по заданным координатам производится поиск ближайших станций метро.
en: This example uses reverse geocoding: using specified coordinates, we perform a search for the nearest metro stations.

source: Создаем метку.
en: Creating a placemark.

source: Пример демонстрирует, как создать меню для отображения коллекций геообъектов карты.
en: The example demonstrates how to create a menu to display collections of geo objects on the map.

source: Для построения такого меню необходимо создать два представления геообъекта: его API-представление (в виде метки на карте) и его DOM-представление (то есть элемент меню).
en: To create such a menu, you must create two representations of a geo object: its API-representation (in the form of placemarks on the map) and its DOM representation (i.e. the menu item).

source: Связать эти представления можно внутри обработчика события у DOM-представления (клик на пункте меню) вызовом конкретных методов в API-представлении геообъекта (добавление/удаление метки с карты).
en: These representations can be linked inside the event handler for the DOM representation (click on menu item) by calling specific methods in the API representation of the geo object (adding/removing placemarks on the map).

source: В этом примере меню строится на основе массива данных, который определен в файле groups.js.
en: In this example, the menu is based on the data array that is defined in the file groups.js.

source: Подробнее пример обсуждается в клубе.
en: The example is discussed in more detail in the club.

source: В примере показано, как произвести загрузку данных с помощью функции JQuery.getJSON() и отобразить их на карте.
en: The example shows how to load data using JQuery.getJSON() and display it on the map.

source: Загруженные данные представлены в формате GeoJSON. Для их добавления на карту необходимо использовать [#$dp10].
en: The loaded data is presented in GeoJSON format. To add it to the map, use [#$dp10].

source: Обратите внимание, что координаты объектов заданы в последовательности "долгота, широта". Поскольку по умолчанию в API принят порядок "широта, долгота", необходимо при подключении API передать параметр coordorder со значением lotlang. Подробнее см. в разделе Подключение API.
en: Note that the object coordinates are specified in the order "longitude, latitude". Since the order "latitude, longitude" is used by default in the API, you must pass the "coordorder" parameter with the value "lotlang" when enabling the API. For more information, see Enabling the API.

source: В данном примере создается пользовательский макет выпадающего списка. Макет элемента управления строится на основе его данных, состояния и опций. Макет автоматически перестраивается при изменении значений полей, состояния или опций, которые используются в его текстовом шаблоне.
en: This example creates a custom layout for the drop-down list. The layout of the control is based on its data, status, and options. The layout is automatically rebuilt when changes are made to the values of fields, states, or options that are used in its text template.

source: Выпадающий список по умолчанию реагирует на клик по своему макету и меняет значение поля state.get('expanded').
en: A drop-down list by default responds to a click on its layout and changes the value of the field state.get('expanded').

source: События макета, на которые реагирует выпадающий список, описаны в интерфейсах [#$dp17] и [#$dp18].
en: Layout events that the drop-down list responds to are described in the interfaces [#$dp17] and [#$dp18].

source: Выпадающий список является групповым элементом управления, поэтому его макет должен генерировать события и реализовывать методы, описанные в [#$dp21].
en: A drop-down list is a group control, so its layout must generate events and implement the methods described in [#$dp21].

source: Через опции можно задавать настройки как самого выпадающего списка, так и настройки для его дочерних элементов. Для этого опции дочерних элементов нужно указывать с префиксом 'item'.
en: Through the options you can configure the drop-down list itself, as well as settings for its child elements. To do this, child element options must be specified with the 'item' prefix.

source: В примере показано, как осуществлять загрузку данных для балуна объекта по требованию.
en: This example shows how to load data for an object's balloon on demand.

source: В примере используется макет балуна кластера "cluster#balloonCarousel". Макет, в котором информация о геообъекте располагается в центре, а по бокам располагаются кнопки перехода к предыдущему и следующему геообъекту. В нижней части балуна находится меню быстрой навигации. Информация о выбранном геообъекте задается отдельным макетом и может быть настроена при помощи опции 'clusterBalloonItemContentLayout'. В данном примере задается собственный макет с информацией о геообъекте. Макеты объектов можно создавать с помощью фабрики [#$dp10], используя текcтовые шаблоны. Текстовые шаблоны формируют html-содержимое макета на основе хэша с данными, передаваемого в конструктор макета. В данном примере поставщик данных - это геообъект.
en: The example uses the "cluster#balloonCarousel" layout for the cluster balloon. In this layout, the information about the geo object is located in the center, and on each side are buttons to go to the previous and next geo object. At the bottom of the balloon is a quick navigation menu. Information about the selected geo object is defined as a separate layout and can be configured using the 'clusterBalloonItemContentLayout' option. In this example, you set your own layout with information about the geo object. Object layouts can be created using the [#$dp10] factory, using text templates. Text templates generate HTML content for the layout based on the hash of the data that is passed to the layout constructor. In this example, the data provider is a geo object.

source: Координаты вершин внутреннего контура.
en: The coordinates of the vertices of the inner contour.

source: Ширина обводки.
en: The stroke width.

source: Добавляем многоугольник на карту.
en: Adding the polygon to the map.

source: Элемент управления — визуальный объект, позволяющий пользователю управлять картой (например, перемещать карту, изменять её тип или коэффициент масштабирования).
en: A control is a visual object that allows the user to manipulate the map (for example, move the map, change its type, or change the zoom).

source: Каждый элемент управления реализуется отдельным классом из пространства имен control (например, [#$dp9]).
en: Each control is implemented by a separate class from the control namespace (for example, [#$dp9]).

source: Элемент управления "пробки" можно подключать как через ключ 'trafficControl', так и создавая экземпляр класса [#$dp12]. При создании экземпляра класса можно указывать начальное состояние элемента управления.
en: The "Traffic" control can be enabled either via the 'trafficControl' key, or by creating an instance of the [#$dp12] class. When creating a class instance, you can specify the initial state of the control.

source: В этом примере обрабатывается событие геообъекта - щелчок правой кнопкой мыши на метке, и отображется контекстное меню для управления его свойствами.
en: In this example, a geo object event is handled - when the placemark is right-clicked, the context menu is displayed for managing its properties.

source: В данном примере создаются три метки со своими HTML макетами. Создание своих макетов происходит при помощи фабрики макетов. Всем меткам задаются разные фигуры активных областей: прямоугольник, круг и полигон. Метка, чтобы ловить события мышки, использует активную область. По умолчанию при задании своего HTML макета фигура активной области не задается, и её нужно задать самостоятельно. Это можно сделать при помощи опции метки iconShape в виде JSON описания геометрии.
en: In this example, three placemarks are created with their HTML layouts. Custom layouts are created using layout factories. All placemarks are assigned different hotspot shapes: rectangle, circle and polygon. In order to catch mouse events, a placemark uses the hotspot. By default, when you set your HTML layout, the hotspot shape is not defined, and you need to set it yourself. This can be done using the iconShape placemark option in the form of a JSON description of the geometry.

source: В данном примере при инициализации загружаются только модули карты и кнопки. По клику кнопки происходит загрузка модуля метки. Загрузку отдельных модулей можно производить при помощи метода require модульной системы. Метод возвращет объект-обещание, который подтверждается массивом запрошенных модулей. Для удобства в примере используется метод spread, который передает в функцию данные в виде списка аргументов, а не в виде массива. API Яндекс.Карт состоит из большого количества взаимосвязанных модулей. По умолчанию при подключении API происходит загрузка стандартного набора модулей (package.full), который включает в себя все необходимое для работы API. Для сокращения объема загружаемого кода API можно подключать некоторые модули вместо стандартного набора. Это можно сделать, указав необходимые модули в GET-параметре load. Модули перечисляются через запятую. Если GET-параметр load не указан, то просходит загрузка package.full. Подробнее о работе модулей смотрите в разделе Модули.
en: In this example, only the map and button modules are loaded during initialization. The placemark module is loaded when a button is clicked. You can load individual modules using the require method in the modules system. This method returns a promise object, which is confirmed by the array of requested modules. For convenience, the example uses the "spread" method, which transmits data to the function in the form of a list of arguments, not as an array. The Yandex.Maps API consists of a large number of interconnected modules. By default, when you enable the API, the standard set of modules is loaded (package.full), which includes everything that is necessary for the API. To reduce the amount of API code that is loaded, you can connect certain modules instead of the standard set. This can be done by specifying the necessary modules in the "load" GET parameter. The modules are separated by commas. If the "load" GET parameter is not specified, package.full is loaded. For more information about modules, see Modules.

source: Пример загрузки только необходимых модулей
en: An example of loading only necessary modules

source: Ссылка на редактор маршрута находится в поле editor экземпляра класса router.Route, который будет передан в качестве параметра объекту [#$dp6] после того, как выполнится построение маршрута.
en: The reference to the route editor is found in the editor field of an instance of the router.Route class, which will be passed as a parameter to the [#$dp6] object after building the route.

source: Включать (выключать) редактор можно только внутри функции, которая выполнится, когда от сервера придет результат.
en: The editor can only be turned on (off) inside the function that will be executed when the result comes from the server.

source: ymaps.route(...) // возвращает объект util.Promise .then( function (route) { route.editor.start(); ... }) )
en: ymaps.route(...) // returns an object util.Promise .then( function (route) { route.editor.start(); ... }) )

source: Кластеризатор реализуется классом [#$dp12]. В качестве параметров конструктору можно передать опции кластеризатора: стиль отображения значка кластера, размер его ячейки и т. д. Список доступных опций можно посмотреть в соответствующем разделе справочника. Опции для настройки меток-кластеров задаются в кластеризатор с префиксом "cluster". Список опций меток-кластеров доступен в документации [#$dp14].
en: Clusterer is implemented by the [#$dp12] class. As parameters to the constructor, you can pass clusterization options: display style for the cluster icon, the size of its cell, and so on. For a list of available options, see the corresponding section of the Reference Guide. Options for customizing the cluster placemarks are set in the clusterer using the "cluster" prefix. The list of options for cluster placemarks is available in the documentation [#$dp14].

source: Вы можете задать произвольное изображение для меток кластера. Для этого нужно переопределить опцию clusterIcons.
en: You can set a custom image for cluster placemarks. To do this, override the clusterIcons option.

source: API Яндекс.Карт состоит из большого количества взаимосвязанных модулей. По умолчанию при подключении API происходит загрузка стандартного набора модулей (package.full), который включает в себя все необходимое для работы API. Для сокращения объема загружаемого кода API можно подключать некоторые модули вместо стандартного набора. Это можно сделать, указав необходимые модули в GET-параметре load. Модули перечисляются через запятую. Если GET-параметр load не указан, то просходит загрузка package.full. Подробнее о работе модулей смотрите в разделе Модули. В данном примере загружаются только модули карты, метки и балуна геообъекта. Балун геообъекта подключается при помощи аддона geoObject.addon.balloon. Без подключенного аддона балуна у геообъектов не будет свойства balloon. Все аддоны по умолчанию включены в package.full.
en: The Yandex.Maps API consists of a large number of interconnected modules. By default, when you enable the API, a standard set of modules is loaded (package.full), which includes everything that is necessary for the API. To reduce the amount of API code that is loaded, you can connect certain modules instead of the standard set. This can be done by specifying the necessary modules in the "load" GET parameter. The modules are separated by commas. If the "load" GET parameter is not specified, package.full is loaded. For more information about modules, see Modules. In this example, to load only the modules, cards, placemarks, and a balloon geoobject. balloon geoobject connected using addon geoObject.addon.the balloon. Without connected addon for a balloon at the geoobjects will not be properties of the balloon. All Addons are enabled by default in the package.full.

source: В этом примере слушаются некоторые события геообъекта, и при их наступлении обновляется содержимое текстового поля. Полный список событий можно изучить в документации к классу GeoObject.
en: In this example, certain geo object events are listened to, and when they occur, the contents of the text field are updated. For a full list of events, see the documentation for the GeoObject class.

source: API предоставляет пять встроенных типов карт:
en: The API provides five built-in types of maps:

source: В данном примере создается собственный макет контента балуна кластера. Макет задается опцией 'clusterBalloonContentLayout'. Макеты объектов можно создавать с помощью фабрики [#$dp10], используя текcтовые шаблоны. Текстовые шаблоны формируют html-содержимое макета на основе хэша с данными, передаваемого в конструктор макета. В данном примере поставщиком данных является кластер, у которого был открыт балун. В макете происходит перечисление и вывод полей 'placemarkId' и 'balloonContentHeader' всех геообъектов кластера при помощи конструкции 'for'.
en: In this example, you create your own layout for cluster balloon content. The layout is specified by the 'clusterBalloonContentLayout' option. Object layouts can be created by the [#$dp10] factory using text templates. Text templates generate HTML content of the layout based on the hash of the data that is passed to the layout constructor. In this example, the data provider is the cluster that the balloon was opened on. In the layout the fields 'placemarkId' and 'balloonContentHeader' are listed and output for all the cluster geo objects, using the construction 'for'.

source: Производим наследование от класса кнопки.
en: Performing inheritance from the button class.

source: API Яндекс.Карт состоит из большого количества взаимосвязанных модулей. По умолчанию при подключении API происходит загрузка стандартного набора модулей (package.full), который включает в себя все необходимое для работы API. Разработчик, который использует API Яндекс.Карт, имеет возможность создавать свои модули. В данном примере создается собственный элемент управления со своим макетом. И элемент управления, и макет оформлены в виде отдельных модулей. Определение собственного модуля доступно при помощи метода define После создания карты происходит запрос на получение своего модуля при помощи метода require Подробнее о работе модулей смотрите в разделе Модули.
en: The Yandex.Maps API consists of a large number of interconnected modules. By default, when you enable the API, a standard set of modules is loaded (package.full), which includes everything necessary for the API to work. The developer who uses the Yandex.Maps API can create custom modules. In this example, we create a custom control with a custom layout. Both the control and the layout are designed as separate modules. Use the define method to define a custom module. After creating the map, a request is sent for getting your module using the require method For more details about the modules, see Modules.

source: В версии API 2.0 для определения местоположения по IP или с помощью Geolocation API разработчикам приходилось самостоятельно использовать необходимые методы и обрабатывать полученный результат (см. пример).
en: In API 2.0 versions, to determine the location by IP or by using the Geolocation API, developers had to independently use the necessary methods and process the result (see the example).

source: В API 2.1 встроен специальный элемент управления "геолокация", который позволяет отобразить географическое положение пользователя на карте. Данный элемент управления реализуется классом control.GeolocationControl, которому соответствует ключ 'geolocationControl'.
en: The API 2.1 has a special built-in "geolocation" control, which allows you to display the user's location on the map. This control is implemented by the control.GeolocationControl class, which corresponds to the 'geolocationControl' key.

source: Для добавления элемента управления на карту достаточно указать соответствующий ключ в параметрах карты.
en: To add a control to the map, it is enough to specify the appropriate key in the map parameters.

source: В API 2.1 элементы управления добавляются на карту автоматически при ее создании. По умолчанию на карту добавляется стандартный набор элементов управления 'mediumMapDefaultSet' (см. пример).
en: In the API 2.1, controls are added to the map automatically when it is created. By default, the 'mediumMapDefaultSet' standard set of controls is added to the map (see the example).

source: Для того чтобы добавить на карту нужные элементы управления, в параметре controls при ее создании можно указать список соответствующих ключей. Также элементы управления можно добавить через поле карты Map.controls с помощью метода add.
en: To add the desired controls to the map, a list of corresponding keys can be specified in the controls parameter when it is created. The controls can also be added through the Map.controls map field, using the "add" method.
